Revit 2026 API
Revision.Create Method
 Creates a new Revision in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static Revision Create(
	Document document
)
Public Shared Function Create (
	document As Document
) As Revision
public:
static Revision^ Create(
	Document^ document
)
static member Create :
        document : Document -> Revision
Parameters
document Document
 The document of the new Revision.
Return Value
Revision
 The newly created Revision.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
Remarks
 The new Revision will be added at the end of the sequence of existing Revisions.
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace